Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Benefits for people who are sick or have a disability An overview of benefits available to people who are sick or have a disability
ga: Overview Document Sochair do dhaoine atá tinn nó atá faoi mhíchumas Soláthraíonn an doiciméad seo forbhreathnú ar na sochair atá ar fáil do dhaoine atá tinn nó atá faoi mhícumas

source: Information about Illness Benefit, a payment made to people under 66 who are unable to work because of illness
ga: Cur síos ar Shochar Breoiteachta íocaíocht a dhéantar do dhaoine faoi bhun 66 nach bhfuil ábalta obair a dhéanamh ó thaobh breoiteachta

source: Invalidity Pension is a social insurance payment that may be paid to people who cannot work because of a long-term illness or disability
ga: Is éard Pinsean Easláinte íocaíocht leasa shóisialaigh a íoctar le daoine mura raibh siad i riocht oibre agus go raibh siad ag fáil Sochar Breoiteachta ar feadh 12 mhí ar a laghad roimh dháta d'iarratas

source: A weekly payment to people that have an injury, illness or disability which is expected to last more than a year
ga: Íocaíocht sheachtainiúil do dhaoine le gortú, tinneas nó míchumas orthu a mbítear ag súil go mairfidh go ceann aon bhliain ar a laghad

source: Find out how to qualify and rates of payment
ga: Faigh amach conas a cháiliú agus na rátaí íocaíochta

source: The Blind Pension is a means tested payment paid to blind and visually impaired people normally living in Ireland
ga: Íocaíocht le scrúdú maoine é Pinsean na nDall a íoctar leis na daill agus le daoine atá faoi mhíchumas na súl a bhfuil gnáthchónaí in Éirinn orthu

source: Find out more about this social welfare payment and how to apply
ga: Faigh amach tuilleadh faoin íocaíocht leasa shóisialaigh seo agus conas iarratas a dhéanamh

source: The Treatment Benefit Scheme is a scheme run by the Department of Social Protection that provides dental, optical and aural services to people with the required number of PRSI contributions
ga: Is scéim í an Scéim um Shochar Cóireála a reáchtálann an Roinn Coimirce Sóisialaí agus a chuireann seirbhísí fiaclóireachta, súl agus cluas ar fáil do dhaoine a bhfuil an méid riachtanach ranníocaíochtaí ÁSPC acu

source: Occupational Injuries Scheme - Introduction
ga: Scéim na Sochair Gortuithe Ceirde - Ginearálta

source: The Occupational Injuries Benefit scheme provides a range of benefits for people injured or incapacitated by an accident at work or while travelling directly to or from work
ga: Soláthraíonn an scéim Sochair Gortuithe Ceirde raon sochar d'fhostaithe má tá siad gortuithe nó neamhábalta chun na hoibre de bharr timpiste le linn na hoibre nó fad is a bhí siad ag taisteal chuig/ón obair. Liosta sochar sa scéim

source: Injury Benefit is a weekly payment made to employees in Ireland who are unfit for work as a result of an accident at work or because they have contracted a disease due to the type of work they do. Find out more
ga: Íocaíocht sheachtainiúil é Sochar Díobhála a dhéantar le fostaithe má tá siad neamhábalta chun na hoibre de bharr timpiste le linn na hoibre nó de bharr galar ceirde a thagann orthu de dheasca na hoibre a dhéanann siad

source: Disablement benefit may be payable to you if as a result of an accident at work in Ireland or a prescribed disease contracted at work, you suffer a loss of physical or mental faculty
ga: Is féidir Sochar Míthreorach a íoc leat má chailleann tú cumas fisiceach nó meabhrach de bharr timpiste a tharla agus tú ag obair, timpiste nó de bharr galair a bhuail thú ag obair

source: If you are an insured employee in Ireland and are injured at work or contract a prescribed occupational disease you may be entitled to a refund of medical costs
ga: Tá duine faoi árachas a gortaíodh ag an obair nó a bhfuil galar áirithe ceirde faighte acu i dteideal sochair leasa shóisialaigh a fháil

source: Disability payments and work
ga: Na híocaíochtaí míchumais agus obair

source: Information on how rehabilitative work or training can affect your disability payment and any extra benefits you are getting
ga: Faisnéis faoi conas a fhéadann obair athshlánúcháin nó oiliúint athshlánúcháin dul i bhfeidhm ar d’íocaíocht míchumais agus ar aon sochair bhreise atá á bhfáil agat

source: This document is in: Social Welfare > Social welfare payments > Social welfare payments and work
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Íocaíochtaí Leasa Shóisialaigh agus Obair

source: A Domiciliary Care Allowance is a monthly payment made to the carer of a child with a severe disability who lives at home
ga: Íocaíocht mhíosúil é Liúntas Cúram Baile a dhéantar le cúramóir linbh a bhfuil míchumas trom air agus a bhfuil ina chónaí sa bhaile

source: Partial Capacity Benefit is a scheme to support people on Illness Benefit or Invalidity Pension who want to return to work
ga: Scéim atá i gceist leis an Sochar Cumais Pháirtigh le tacaíocht a thabhairt do dhaoine a fhaigheann Sochar Breoiteachta nó Pinsean Easláinte ar mian leo filleadh ar an obair

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
